In [2]:
import pandas as pd

In [3]:
df = pd.read_excel('Date & WL .xlsx', names=None, index_col=0)
df.head()

        Date  AVE_WL(m)
0 1994-01-01       2.62
1 1994-01-02       2.61
2 1994-01-03       2.60
3 1994-01-04       2.60
4 1994-01-05       2.59

In [4]:
df.tail()

            Date  AVE_WL(m)
10683 2023-12-27       1.55
10684 2023-12-28       1.53
10685 2023-12-29       1.52
10686 2023-12-30       1.51
10687 2023-12-31       1.48

Create Date from 1994 to 2023

In [5]:
OriginalDate = pd.date_range( start = pd.to_datetime('01/01/1994'), end = pd.to_datetime('31/12/2023'))
df2 = pd.DataFrame(OriginalDate)
df2.columns = ['Date']
df2

C:\Users\MASUD RANA\AppData\Local\Temp\ipykernel_2032\3748061804.py:1: UserWarning: Parsing dates in %d/%m/%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  OriginalDate = pd.date_range( start = pd.to_datetime('01/01/1994'), end = pd.to_datetime('31/12/2023'))

            Date
0     1994-01-01
1     1994-01-02
2     1994-01-03
3     1994-01-04
4     1994-01-05
...          ...
10952 2023-12-27
10953 2023-12-28
10954 2023-12-29
10955 2023-12-30
10956 2023-12-31

[10957 rows x 1 columns]

#Merge

In [6]:
merged_data = pd.merge(df2, df, on='Date', how='outer')
merged_data

            Date  AVE_WL(m)
0     1994-01-01       2.62
1     1994-01-02       2.61
2     1994-01-03       2.60
3     1994-01-04       2.60
4     1994-01-05       2.59
...          ...        ...
10952 2023-12-27       1.55
10953 2023-12-28       1.53
10954 2023-12-29       1.52
10955 2023-12-30       1.51
10956 2023-12-31       1.48

[10957 rows x 2 columns]

In [40]:
merged_data.to_excel('ssss.xlsx')

In [19]:
type(merged_data['AVE_WL(m)'][2])

numpy.float64

In [42]:
missing_water_level = merged_data[merged_data['AVE_WL(m)'].isnull()]
missing_water_level

           Date  AVE_WL(m)
1065 1996-12-01        NaN
1066 1996-12-02        NaN
1067 1996-12-03        NaN
1068 1996-12-04        NaN
1069 1996-12-05        NaN
...         ...        ...
4846 2007-04-09        NaN
4847 2007-04-10        NaN
4848 2007-04-11        NaN
4849 2007-04-12        NaN
4850 2007-04-13        NaN

[269 rows x 2 columns]

In [43]:
missing_water_level.to_excel('miss .xlsx')

In [25]:
x = pd.isnull(merged_data)
x.head()

    Date  AVE_WL(m)
0  False      False
1  False      False
2  False      False
3  False      False
4  False      False

In [31]:
y = x.loc[ x['AVE_WL(m)'] == True ]
y.head()

       Date  AVE_WL(m)
1065  False       True
1066  False       True
1067  False       True
1068  False       True
1069  False       True

In [21]:
pd.isnull(merged_data).sum()

Date           0
AVE_WL(m)    269
dtype: int64

#Interpolate

In [22]:
df_final = merged_data.interpolate( method='linear')
df_final

            Date  AVE_WL(m)
0     1994-01-01       2.62
1     1994-01-02       2.61
2     1994-01-03       2.60
3     1994-01-04       2.60
4     1994-01-05       2.59
...          ...        ...
10952 2023-12-27       1.55
10953 2023-12-28       1.53
10954 2023-12-29       1.52
10955 2023-12-30       1.51
10956 2023-12-31       1.48

[10957 rows x 2 columns]

In [23]:
pd.isnull(df_final).sum()

Date         0
AVE_WL(m)    0
dtype: int64

#Extract Pre-Proccessed Data

In [24]:
df_final.to_excel('WL Pre-Proccessed Data .xlsx')